yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_io_qspi.h
/****************************************************************************
 * arch/arm/src/rp2040/hardware/rp2040_io_qspi.h
 *
 * Generated from rp2040.svd originally provided by
 *   Raspberry Pi (Trading) Ltd.
 *
 * Copyright 2020 (c) 2020 Raspberry Pi (Trading) Ltd.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name of the copyright holder nor the names of its
 *    contributors may be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_IO_QSPI_H
#define __ARCH_ARM_SRC_RP2040_HARDWARE_RP2040_IO_QSPI_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include "hardware/rp2040_memorymap.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register offsets *********************************************************/

#define RP2040_IO_QSPI_GPIO_QSPI_SCLK_STATUS_OFFSET  0x000000  /* GPIO status */
#define RP2040_IO_QSPI_GPIO_QSPI_SCLK_CTRL_OFFSET    0x000004  /* GPIO control including function select and overrides. */
#define RP2040_IO_QSPI_GPIO_QSPI_SS_STATUS_OFFSET    0x000008  /* GPIO status */
#define RP2040_IO_QSPI_GPIO_QSPI_SS_CTRL_OFFSET      0x00000c  /* GPIO control including function select and overrides. */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_STATUS_OFFSET   0x000010  /* GPIO status */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OFFSET     0x000014  /* GPIO control including function select and overrides. */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_STATUS_OFFSET   0x000018  /* GPIO status */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OFFSET     0x00001c  /* GPIO control including function select and overrides. */
#define RP2040_IO_QSPI_GPIO_QSPI_SD2_STATUS_OFFSET   0x000020  /* GPIO status */
#define RP2040_IO_QSPI_GPIO_QSPI_SD2_CTRL_OFFSET     0x000024  /* GPIO control including function select and overrides. */
#define RP2040_IO_QSPI_GPIO_QSPI_SD3_STATUS_OFFSET   0x000028  /* GPIO status */
#define RP2040_IO_QSPI_GPIO_QSPI_SD3_CTRL_OFFSET     0x00002c  /* GPIO control including function select and overrides. */
#define RP2040_IO_QSPI_INTR_OFFSET                   0x000030  /* Raw Interrupts */
#define RP2040_IO_QSPI_PROC0_INTE_OFFSET             0x000034  /* Interrupt Enable for proc0 */
#define RP2040_IO_QSPI_PROC0_INTF_OFFSET             0x000038  /* Interrupt Force for proc0 */
#define RP2040_IO_QSPI_PROC0_INTS_OFFSET             0x00003c  /* Interrupt status after masking & forcing for proc0 */
#define RP2040_IO_QSPI_PROC1_INTE_OFFSET             0x000040  /* Interrupt Enable for proc1 */
#define RP2040_IO_QSPI_PROC1_INTF_OFFSET             0x000044  /* Interrupt Force for proc1 */
#define RP2040_IO_QSPI_PROC1_INTS_OFFSET             0x000048  /* Interrupt status after masking & forcing for proc1 */
#define RP2040_IO_QSPI_DORMANT_WAKE_INTE_OFFSET      0x00004c  /* Interrupt Enable for dormant_wake */
#define RP2040_IO_QSPI_DORMANT_WAKE_INTF_OFFSET      0x000050  /* Interrupt Force for dormant_wake */
#define RP2040_IO_QSPI_DORMANT_WAKE_INTS_OFFSET      0x000054  /* Interrupt status after masking & forcing for dormant_wake */

/* Register definitions *****************************************************/

#define RP2040_IO_QSPI_GPIO_QSPI_SCLK_STATUS  (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_GPIO_QSPI_SCLK_STATUS_OFFSET)
#define RP2040_IO_QSPI_GPIO_QSPI_SCLK_CTRL    (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_GPIO_QSPI_SCLK_CTRL_OFFSET)
#define RP2040_IO_QSPI_GPIO_QSPI_SS_STATUS    (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_GPIO_QSPI_SS_STATUS_OFFSET)
#define RP2040_IO_QSPI_GPIO_QSPI_SS_CTRL      (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_GPIO_QSPI_SS_CTRL_OFFSET)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_STATUS   (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_GPIO_QSPI_SD0_STATUS_OFFSET)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL     (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OFFSET)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_STATUS   (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_GPIO_QSPI_SD1_STATUS_OFFSET)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL     (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OFFSET)
#define RP2040_IO_QSPI_GPIO_QSPI_SD2_STATUS   (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_GPIO_QSPI_SD2_STATUS_OFFSET)
#define RP2040_IO_QSPI_GPIO_QSPI_SD2_CTRL     (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_GPIO_QSPI_SD2_CTRL_OFFSET)
#define RP2040_IO_QSPI_GPIO_QSPI_SD3_STATUS   (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_GPIO_QSPI_SD3_STATUS_OFFSET)
#define RP2040_IO_QSPI_GPIO_QSPI_SD3_CTRL     (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_GPIO_QSPI_SD3_CTRL_OFFSET)
#define RP2040_IO_QSPI_INTR                   (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_INTR_OFFSET)
#define RP2040_IO_QSPI_PROC0_INTE             (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_PROC0_INTE_OFFSET)
#define RP2040_IO_QSPI_PROC0_INTF             (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_PROC0_INTF_OFFSET)
#define RP2040_IO_QSPI_PROC0_INTS             (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_PROC0_INTS_OFFSET)
#define RP2040_IO_QSPI_PROC1_INTE             (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_PROC1_INTE_OFFSET)
#define RP2040_IO_QSPI_PROC1_INTF             (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_PROC1_INTF_OFFSET)
#define RP2040_IO_QSPI_PROC1_INTS             (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_PROC1_INTS_OFFSET)
#define RP2040_IO_QSPI_DORMANT_WAKE_INTE      (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_DORMANT_WAKE_INTE_OFFSET)
#define RP2040_IO_QSPI_DORMANT_WAKE_INTF      (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_DORMANT_WAKE_INTF_OFFSET)
#define RP2040_IO_QSPI_DORMANT_WAKE_INTS      (RP2040_IO_QSPI_BASE + RP2040_IO_QSPI_DORMANT_WAKE_INTS_OFFSET)

/* Register bit definitions *************************************************/

#define RP2040_IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQTOPROC              (1 << 26)  /* interrupt to processors, after override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SCLK_STATUS_IRQFROMPAD             (1 << 24)  /* interrupt from pad before override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SCLK_STATUS_INTOPERI               (1 << 19)  /* input signal to peripheral, after override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SCLK_STATUS_INFROMPAD              (1 << 17)  /* input signal from pad, before override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SCLK_STATUS_OETOPAD                (1 << 13)  /* output enable to pad after register override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SCLK_STATUS_OEFROMPERI             (1 << 12)  /* output enable from selected peripheral, before register override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTTOPAD               (1 << 9)  /* output signal to pad after register override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SCLK_STATUS_OUTFROMPERI            (1 << 8)  /* output signal from selected peripheral, before register override is applied */

