yunkya2/incubator-nuttx/arch/arm/src/rp2040/hardware/new/rp2040_io_qspi.h
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQTOPROC               (1 << 26)  /* interrupt to processors, after override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_STATUS_IRQFROMPAD              (1 << 24)  /* interrupt from pad before override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_STATUS_INTOPERI                (1 << 19)  /* input signal to peripheral, after override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_STATUS_INFROMPAD               (1 << 17)  /* input signal from pad, before override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_STATUS_OETOPAD                 (1 << 13)  /* output enable to pad after register override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_STATUS_OEFROMPERI              (1 << 12)  /* output enable from selected peripheral, before register override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTTOPAD                (1 << 9)  /* output signal to pad after register override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_STATUS_OUTFROMPERI             (1 << 8)  /* output signal from selected peripheral, before register override is applied */

#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_SHIFT             (28)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_MASK              (0x03 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_SHIFT)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_NORMAL            (0x0 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_SHIFT)  /* don't invert the interrupt */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_INVERT            (0x1 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_SHIFT)  /* invert the interrupt */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_LOW               (0x2 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_SHIFT)  /* drive interrupt low */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_HIGH              (0x3 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_IRQOVER_SHIFT)  /* drive interrupt high */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_SHIFT              (16)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_MASK               (0x03 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_SHIFT)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_NORMAL             (0x0 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_SHIFT)  /* don't invert the peri input */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_INVERT             (0x1 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_SHIFT)  /* invert the peri input */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_LOW                (0x2 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_SHIFT)  /* drive peri input low */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_HIGH               (0x3 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_INOVER_SHIFT)  /* drive peri input high */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_SHIFT              (12)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_MASK               (0x03 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_SHIFT)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_NORMAL             (0x0 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_SHIFT)  /* drive output enable from peripheral signal selected by funcsel */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_INVERT             (0x1 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_SHIFT)  /* drive output enable from inverse of peripheral signal selected by funcsel */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_DISABLE            (0x2 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_SHIFT)  /* disable output */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_ENABLE             (0x3 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OEOVER_SHIFT)  /* enable output */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_SHIFT             (8)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_MASK              (0x03 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_SHIFT)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_NORMAL            (0x0 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_SHIFT)  /* drive output from peripheral signal selected by funcsel */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_INVERT            (0x1 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_SHIFT)  /* drive output from inverse of peripheral signal selected by funcsel */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_LOW               (0x2 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_SHIFT)  /* drive output low */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_HIGH              (0x3 << RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_OUTOVER_SHIFT)  /* drive output high */
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_MASK              (0x1f)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_XIP_SD0           (0x0)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_SIO_32            (0x5)
#define RP2040_IO_QSPI_GPIO_QSPI_SD0_CTRL_FUNCSEL_NULL              (0x1f)

#define RP2040_IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQTOPROC               (1 << 26)  /* interrupt to processors, after override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_STATUS_IRQFROMPAD              (1 << 24)  /* interrupt from pad before override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_STATUS_INTOPERI                (1 << 19)  /* input signal to peripheral, after override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_STATUS_INFROMPAD               (1 << 17)  /* input signal from pad, before override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_STATUS_OETOPAD                 (1 << 13)  /* output enable to pad after register override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_STATUS_OEFROMPERI              (1 << 12)  /* output enable from selected peripheral, before register override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTTOPAD                (1 << 9)  /* output signal to pad after register override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_STATUS_OUTFROMPERI             (1 << 8)  /* output signal from selected peripheral, before register override is applied */

#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_SHIFT             (28)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_MASK              (0x03 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_SHIFT)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_NORMAL            (0x0 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_SHIFT)  /* don't invert the interrupt */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_INVERT            (0x1 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_SHIFT)  /* invert the interrupt */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_LOW               (0x2 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_SHIFT)  /* drive interrupt low */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_HIGH              (0x3 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_IRQOVER_SHIFT)  /* drive interrupt high */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_SHIFT              (16)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_MASK               (0x03 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_SHIFT)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_NORMAL             (0x0 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_SHIFT)  /* don't invert the peri input */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_INVERT             (0x1 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_SHIFT)  /* invert the peri input */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_LOW                (0x2 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_SHIFT)  /* drive peri input low */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_HIGH               (0x3 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_INOVER_SHIFT)  /* drive peri input high */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_SHIFT              (12)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_MASK               (0x03 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_SHIFT)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_NORMAL             (0x0 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_SHIFT)  /* drive output enable from peripheral signal selected by funcsel */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_INVERT             (0x1 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_SHIFT)  /* drive output enable from inverse of peripheral signal selected by funcsel */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_DISABLE            (0x2 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_SHIFT)  /* disable output */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_ENABLE             (0x3 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OEOVER_SHIFT)  /* enable output */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_SHIFT             (8)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_MASK              (0x03 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_SHIFT)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_NORMAL            (0x0 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_SHIFT)  /* drive output from peripheral signal selected by funcsel */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_INVERT            (0x1 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_SHIFT)  /* drive output from inverse of peripheral signal selected by funcsel */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_LOW               (0x2 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_SHIFT)  /* drive output low */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_HIGH              (0x3 << RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_OUTOVER_SHIFT)  /* drive output high */
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_MASK              (0x1f)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_XIP_SD1           (0x0)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_SIO_33            (0x5)
#define RP2040_IO_QSPI_GPIO_QSPI_SD1_CTRL_FUNCSEL_NULL              (0x1f)

#define RP2040_IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQTOPROC               (1 << 26)  /* interrupt to processors, after override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD2_STATUS_IRQFROMPAD              (1 << 24)  /* interrupt from pad before override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD2_STATUS_INTOPERI                (1 << 19)  /* input signal to peripheral, after override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD2_STATUS_INFROMPAD               (1 << 17)  /* input signal from pad, before override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD2_STATUS_OETOPAD                 (1 << 13)  /* output enable to pad after register override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD2_STATUS_OEFROMPERI              (1 << 12)  /* output enable from selected peripheral, before register override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTTOPAD                (1 << 9)  /* output signal to pad after register override is applied */
#define RP2040_IO_QSPI_GPIO_QSPI_SD2_STATUS_OUTFROMPERI             (1 << 8)  /* output signal from selected peripheral, before register override is applied */

